; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	spectrograph1 - mode
	image0 - mode
	infrared2 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star0 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 118)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 125)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star3)
	(supports instrument4 image0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 184)
	(supports instrument5 infrared2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 128)
	(= (data Phenomenon5 spectrograph1) 186)
	(= (data Phenomenon6 spectrograph1) 41)
	(= (data Phenomenon7 spectrograph1) 171)
	(= (data Planet8 spectrograph1) 120)
	(= (data Phenomenon9 spectrograph1) 296)
	(= (data Phenomenon10 spectrograph1) 276)
	(= (data Planet11 spectrograph1) 12)
	(= (data Phenomenon5 image0) 173)
	(= (data Phenomenon6 image0) 31)
	(= (data Phenomenon7 image0) 252)
	(= (data Planet8 image0) 215)
	(= (data Phenomenon9 image0) 15)
	(= (data Phenomenon10 image0) 195)
	(= (data Planet11 image0) 276)
	(= (data Phenomenon5 infrared2) 276)
	(= (data Phenomenon6 infrared2) 84)
	(= (data Phenomenon7 infrared2) 275)
	(= (data Planet8 infrared2) 201)
	(= (data Phenomenon9 infrared2) 184)
	(= (data Phenomenon10 infrared2) 162)
	(= (data Planet11 infrared2) 155)
	(= (slew_time Star1 Star0) 3.181)
	(= (slew_time Star0 Star1) 3.181)
	(= (slew_time Star2 Star0) 50.46)
	(= (slew_time Star0 Star2) 50.46)
	(= (slew_time Star2 Star1) 77.79)
	(= (slew_time Star1 Star2) 77.79)
	(= (slew_time Star3 Star0) 55.84)
	(= (slew_time Star0 Star3) 55.84)
	(= (slew_time Star3 Star1) 42.79)
	(= (slew_time Star1 Star3) 42.79)
	(= (slew_time Star3 Star2) 56.55)
	(= (slew_time Star2 Star3) 56.55)
	(= (slew_time GroundStation4 Star0) 40.74)
	(= (slew_time Star0 GroundStation4) 40.74)
	(= (slew_time GroundStation4 Star1) 25.44)
	(= (slew_time Star1 GroundStation4) 25.44)
	(= (slew_time GroundStation4 Star2) 42.08)
	(= (slew_time Star2 GroundStation4) 42.08)
	(= (slew_time GroundStation4 Star3) 38.35)
	(= (slew_time Star3 GroundStation4) 38.35)
	(= (slew_time Phenomenon5 Star0) 76.47)
	(= (slew_time Star0 Phenomenon5) 76.47)
	(= (slew_time Phenomenon5 Star1) 12.99)
	(= (slew_time Star1 Phenomenon5) 12.99)
	(= (slew_time Phenomenon5 Star2) 58.03)
	(= (slew_time Star2 Phenomenon5) 58.03)
	(= (slew_time Phenomenon5 Star3) 8.034)
	(= (slew_time Star3 Phenomenon5) 8.034)
	(= (slew_time Phenomenon5 GroundStation4) 23.86)
	(= (slew_time GroundStation4 Phenomenon5) 23.86)
	(= (slew_time Phenomenon6 Star0) 53.1)
	(= (slew_time Star0 Phenomenon6) 53.1)
	(= (slew_time Phenomenon6 Star1) 75.25)
	(= (slew_time Star1 Phenomenon6) 75.25)
	(= (slew_time Phenomenon6 Star2) 8.851)
	(= (slew_time Star2 Phenomenon6) 8.851)
	(= (slew_time Phenomenon6 Star3) 8.744)
	(= (slew_time Star3 Phenomenon6) 8.744)
	(= (slew_time Phenomenon6 GroundStation4) 19.26)
	(= (slew_time GroundStation4 Phenomenon6) 19.26)
	(= (slew_time Phenomenon6 Phenomenon5) 19.72)
	(= (slew_time Phenomenon5 Phenomenon6) 19.72)
	(= (slew_time Phenomenon7 Star0) 33.71)
	(= (slew_time Star0 Phenomenon7) 33.71)
	(= (slew_time Phenomenon7 Star1) 36.61)
	(= (slew_time Star1 Phenomenon7) 36.61)
	(= (slew_time Phenomenon7 Star2) 14.56)
	(= (slew_time Star2 Phenomenon7) 14.56)
	(= (slew_time Phenomenon7 Star3) 15.87)
	(= (slew_time Star3 Phenomenon7) 15.87)
	(= (slew_time Phenomenon7 GroundStation4) 58.84)
	(= (slew_time GroundStation4 Phenomenon7) 58.84)
	(= (slew_time Phenomenon7 Phenomenon5) 30.7)
	(= (slew_time Phenomenon5 Phenomenon7) 30.7)
	(= (slew_time Phenomenon7 Phenomenon6) 33.11)
	(= (slew_time Phenomenon6 Phenomenon7) 33.11)
	(= (slew_time Planet8 Star0) 6.387)
	(= (slew_time Star0 Planet8) 6.387)
	(= (slew_time Planet8 Star1) 35.84)
	(= (slew_time Star1 Planet8) 35.84)
	(= (slew_time Planet8 Star2) 94.85)
	(= (slew_time Star2 Planet8) 94.85)
	(= (slew_time Planet8 Star3) 3.233)
	(= (slew_time Star3 Planet8) 3.233)
	(= (slew_time Planet8 GroundStation4) 16.14)
	(= (slew_time GroundStation4 Planet8) 16.14)
	(= (slew_time Planet8 Phenomenon5) 42.12)
	(= (slew_time Phenomenon5 Planet8) 42.12)
	(= (slew_time Planet8 Phenomenon6) 68.7)
	(= (slew_time Phenomenon6 Planet8) 68.7)
	(= (slew_time Planet8 Phenomenon7) 62.94)
	(= (slew_time Phenomenon7 Planet8) 62.94)
	(= (slew_time Phenomenon9 Star0) 59.78)
	(= (slew_time Star0 Phenomenon9) 59.78)
	(= (slew_time Phenomenon9 Star1) 36.49)
	(= (slew_time Star1 Phenomenon9) 36.49)
	(= (slew_time Phenomenon9 Star2) 12.89)
	(= (slew_time Star2 Phenomenon9) 12.89)
	(= (slew_time Phenomenon9 Star3) 5.314)
	(= (slew_time Star3 Phenomenon9) 5.314)
	(= (slew_time Phenomenon9 GroundStation4) 15.93)
	(= (slew_time GroundStation4 Phenomenon9) 15.93)
	(= (slew_time Phenomenon9 Phenomenon5) 16.41)
	(= (slew_time Phenomenon5 Phenomenon9) 16.41)
	(= (slew_time Phenomenon9 Phenomenon6) 14.71)
	(= (slew_time Phenomenon6 Phenomenon9) 14.71)
	(= (slew_time Phenomenon9 Phenomenon7) 27.09)
	(= (slew_time Phenomenon7 Phenomenon9) 27.09)
	(= (slew_time Phenomenon9 Planet8) 34.3)
	(= (slew_time Planet8 Phenomenon9) 34.3)
	(= (slew_time Phenomenon10 Star0) 31.48)
	(= (slew_time Star0 Phenomenon10) 31.48)
	(= (slew_time Phenomenon10 Star1) 27.16)
	(= (slew_time Star1 Phenomenon10) 27.16)
	(= (slew_time Phenomenon10 Star2) 5.711)
	(= (slew_time Star2 Phenomenon10) 5.711)
	(= (slew_time Phenomenon10 Star3) 59.58)
	(= (slew_time Star3 Phenomenon10) 59.58)
	(= (slew_time Phenomenon10 GroundStation4) 35.97)
	(= (slew_time GroundStation4 Phenomenon10) 35.97)
	(= (slew_time Phenomenon10 Phenomenon5) 44.21)
	(= (slew_time Phenomenon5 Phenomenon10) 44.21)
	(= (slew_time Phenomenon10 Phenomenon6) 14.35)
	(= (slew_time Phenomenon6 Phenomenon10) 14.35)
	(= (slew_time Phenomenon10 Phenomenon7) 10.49)
	(= (slew_time Phenomenon7 Phenomenon10) 10.49)
	(= (slew_time Phenomenon10 Planet8) 52.76)
	(= (slew_time Planet8 Phenomenon10) 52.76)
	(= (slew_time Phenomenon10 Phenomenon9) 38.63)
	(= (slew_time Phenomenon9 Phenomenon10) 38.63)
	(= (slew_time Planet11 Star0) 44.18)
	(= (slew_time Star0 Planet11) 44.18)
	(= (slew_time Planet11 Star1) 38.97)
	(= (slew_time Star1 Planet11) 38.97)
	(= (slew_time Planet11 Star2) 12.65)
	(= (slew_time Star2 Planet11) 12.65)
	(= (slew_time Planet11 Star3) 2.038)
	(= (slew_time Star3 Planet11) 2.038)
	(= (slew_time Planet11 GroundStation4) 22.45)
	(= (slew_time GroundStation4 Planet11) 22.45)
	(= (slew_time Planet11 Phenomenon5) 53.27)
	(= (slew_time Phenomenon5 Planet11) 53.27)
	(= (slew_time Planet11 Phenomenon6) 6.394)
	(= (slew_time Phenomenon6 Planet11) 6.394)
	(= (slew_time Planet11 Phenomenon7) 53.09)
	(= (slew_time Phenomenon7 Planet11) 53.09)
	(= (slew_time Planet11 Planet8) 80.75)
	(= (slew_time Planet8 Planet11) 80.75)
	(= (slew_time Planet11 Phenomenon9) 43.31)
	(= (slew_time Phenomenon9 Planet11) 43.31)
	(= (slew_time Planet11 Phenomenon10) 36.02)
	(= (slew_time Phenomenon10 Planet11) 36.02)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 Star1)
	(pointing satellite2 GroundStation4)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Planet11 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 planet8 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 184 to 141.88, (fuel-used) from 0 to 42.12
   goals met: 0 of 9
2. (turn_to satellite1 star1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 125 to 47.21, (fuel-used) from 42.12 to 119.91
   goals met: 1 of 9
3. (turn_to satellite0 groundstation4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 118 to 102.07, (fuel-used) from 119.91 to 135.84
   goals met: 2 of 9
4. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 141.88 to 138.647, (fuel-used) from 135.84 to 139.073
   goals met: 2 of 9
5. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 9
6. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 2 of 9
7. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 138.647 to 135.414, (fuel-used) from 139.073 to 142.306
   goals met: 2 of 9
8. (take_image satellite2 planet8 instrument3 infrared2)
   added: (have_image planet8 infrared2)
   changed: (data_capacity satellite2) from 1000 to 799, (data-stored) from 0 to 201
   goals met: 3 of 9
9. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 135.414 to 132.181, (fuel-used) from 142.306 to 145.539
   goals met: 3 of 9
10. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 3 of 9
11. (switch_on instrument3 satellite2)
   deleted: (calibrated instrument3) (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 9
12. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 132.181 to 128.948, (fuel-used) from 145.539 to 148.772
   goals met: 3 of 9
13. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 128.948 to 125.715, (fuel-used) from 148.772 to 152.005
   goals met: 3 of 9
14. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 125.715 to 122.482, (fuel-used) from 152.005 to 155.238
   goals met: 3 of 9
15. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 122.482 to 119.249, (fuel-used) from 155.238 to 158.471
   goals met: 3 of 9
16. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 119.249 to 116.016, (fuel-used) from 158.471 to 161.704
   goals met: 3 of 9
17. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 116.016 to 112.783, (fuel-used) from 161.704 to 164.937
   goals met: 3 of 9
18. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 112.783 to 109.55, (fuel-used) from 164.937 to 168.17
   goals met: 3 of 9
19. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 109.55 to 106.317, (fuel-used) from 168.17 to 171.403
   goals met: 3 of 9
20. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 106.317 to 103.084, (fuel-used) from 171.403 to 174.636
   goals met: 3 of 9
21. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 103.084 to 99.851, (fuel-used) from 174.636 to 177.869
   goals met: 3 of 9
22. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 3 of 9
23. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 99.851 to 96.618, (fuel-used) from 177.869 to 181.102
   goals met: 3 of 9
24. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 96.618 to 93.385, (fuel-used) from 181.102 to 184.335
   goals met: 3 of 9
25. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 93.385 to 90.152, (fuel-used) from 184.335 to 187.568
   goals met: 3 of 9
26. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 90.152 to 86.919, (fuel-used) from 187.568 to 190.801
   goals met: 3 of 9
27. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 3 of 9
28. (turn_to satellite2 planet11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 86.919 to 84.881, (fuel-used) from 190.801 to 192.839
   goals met: 3 of 9
29. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 9
30. (turn_to satellite2 star3 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 84.881 to 82.843, (fuel-used) from 192.839 to 194.877
   goals met: 3 of 9
31. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 82.843 to 79.61, (fuel-used) from 194.877 to 198.11
   goals met: 3 of 9
32. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 79.61 to 76.377, (fuel-used) from 198.11 to 201.343
   goals met: 3 of 9
33. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   changed: (fuel satellite2) from 76.377 to 71.063, (fuel-used) from 201.343 to 206.657
   goals met: 3 of 9
34. (turn_to satellite3 phenomenon7 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon7)
   changed: (fuel satellite3) from 128 to 112.13, (fuel-used) from 206.657 to 222.527
   goals met: 3 of 9
35. (turn_to satellite2 star3 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 71.063 to 65.749, (fuel-used) from 222.527 to 227.841
   goals met: 3 of 9
36. (turn_to satellite2 planet11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 65.749 to 63.711, (fuel-used) from 227.841 to 229.879
   goals met: 3 of 9
37. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 3 of 9
38. (switch_on instrument3 satellite2)
   deleted: (calibrated instrument3) (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 9
39. (turn_to satellite2 star3 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 63.711 to 61.673, (fuel-used) from 229.879 to 231.917
   goals met: 3 of 9
40. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 3 of 9
41. (turn_to satellite2 planet11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 61.673 to 59.635, (fuel-used) from 231.917 to 233.955
   goals met: 3 of 9
42. (take_image satellite2 planet11 instrument3 spectrograph1)
   added: (have_image planet11 spectrograph1)
   changed: (data_capacity satellite2) from 799 to 787, (data-stored) from 201 to 213
   goals met: 4 of 9
43. (turn_to satellite2 phenomenon6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 59.635 to 53.241, (fuel-used) from 233.955 to 240.349
   goals met: 4 of 9
44. (take_image satellite2 phenomenon6 instrument3 infrared2)
   added: (have_image phenomenon6 infrared2)
   changed: (data_capacity satellite2) from 787 to 703, (data-stored) from 213 to 297
   goals met: 5 of 9
45. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 53.241 to 33.521, (fuel-used) from 240.349 to 260.069
   goals met: 5 of 9
46. (take_image satellite2 phenomenon5 instrument3 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   changed: (data_capacity satellite2) from 703 to 517, (data-stored) from 297 to 483
   goals met: 6 of 9
47. (turn_to satellite2 star3 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 33.521 to 25.487, (fuel-used) from 260.069 to 268.103
   goals met: 6 of 9
48. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   changed: (fuel satellite2) from 25.487 to 20.173, (fuel-used) from 268.103 to 273.417
   goals met: 6 of 9
49. (take_image satellite2 phenomenon9 instrument3 infrared2)
   added: (have_image phenomenon9 infrared2)
   changed: (data_capacity satellite2) from 517 to 333, (data-stored) from 483 to 667
   goals met: 7 of 9
50. (turn_to satellite2 groundstation4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation4)
   changed: (fuel satellite2) from 20.173 to 4.243, (fuel-used) from 273.417 to 289.347
   goals met: 8 of 9
51. (turn_to satellite1 star0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 47.21 to 44.029, (fuel-used) from 289.347 to 292.528
   goals met: 7 of 9
52. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 44.029 to 37.642, (fuel-used) from 292.528 to 298.915
   goals met: 7 of 9
53. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 7 of 9
54. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 37.642 to 34.409, (fuel-used) from 298.915 to 302.148
   goals met: 7 of 9
55. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 34.409 to 31.176, (fuel-used) from 302.148 to 305.381
   goals met: 7 of 9
56. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 31.176 to 27.943, (fuel-used) from 305.381 to 308.614
   goals met: 7 of 9
57. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 27.943 to 24.71, (fuel-used) from 308.614 to 311.847
   goals met: 7 of 9
58. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 24.71 to 21.477, (fuel-used) from 311.847 to 315.08
   goals met: 7 of 9
59. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 21.477 to 18.244, (fuel-used) from 315.08 to 318.313
   goals met: 7 of 9
60. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 18.244 to 11.857, (fuel-used) from 318.313 to 324.7
   goals met: 7 of 9
61. (turn_to satellite3 groundstation4 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 groundstation4)
   changed: (fuel satellite3) from 112.13 to 53.29, (fuel-used) from 324.7 to 383.54
   goals met: 7 of 9
62. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 11.857 to 8.676, (fuel-used) from 383.54 to 386.721
   goals met: 8 of 9
63. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 8 of 9
64. (calibrate satellite3 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 8 of 9
65. (turn_to satellite3 planet8 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet8)
   changed: (fuel satellite3) from 53.29 to 37.15, (fuel-used) from 386.721 to 402.861
   goals met: 8 of 9
66. (turn_to satellite3 star3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 37.15 to 33.917, (fuel-used) from 402.861 to 406.094
   goals met: 8 of 9
67. (turn_to satellite3 phenomenon7 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon7)
   changed: (fuel satellite3) from 33.917 to 18.047, (fuel-used) from 406.094 to 421.964
   goals met: 8 of 9
68. (take_image satellite3 phenomenon7 instrument5 infrared2)
   added: (have_image phenomenon7 infrared2)
   changed: (data_capacity satellite3) from 1000 to 725, (data-stored) from 667 to 942
   goals met: 9 of 9
